DocumentJournals/ЛБ_УчетОтходовДМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DocumentJournal>
		<Properties>
			<Name>ЛБ_УчетОтходовДМ</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ЛБ_ПриходОтходовДМ</xr:Item>
				<xr:Item>Document.ЛБ_РасходОтходовДМ</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Приход</Name>
					<References>
						<xr:Item>Document.ЛБ_ПриходОтходовДМ.Attribute.ВесБезТары</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Расход</Name>
					<References>
						<xr:Item>Document.ЛБ_РасходОтходовДМ.Attribute.ВесБезТары</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>НомерНакладной</Name>
					<References>
						<xr:Item>Document.ЛБ_РасходОтходовДМ.Attribute.НомерНакладной</xr:Item>
						<xr:Item>Document.ЛБ_ПриходОтходовДМ.Attribute.НомерНакладнойПеремещения</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.ЛБ_ПриходОтходовДМ.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ЛБ_РасходОтходовДМ.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.ЛБ_ПриходОтходовДМ.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ЛБ_РасходОтходовДМ.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>НомерДокумента</Name>
					<References>
						<xr:Item>Document.ЛБ_ПриходОтходовДМ.Attribute.НомерДокумента</xr:Item>
						<xr:Item>Document.ЛБ_РасходОтходовДМ.Attribute.НомерДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СкладОтправитель</Name>
					<References>
						<xr:Item>Document.ЛБ_ПриходОтходовДМ.Attribute.СкладОтправитель</xr:Item>
						<xr:Item>Document.ЛБ_РасходОтходовДМ.Attribute.Склад</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЛомбардОтправитель</Name>
					<References>
						<xr:Item>Document.ЛБ_ПриходОтходовДМ.Attribute.ЛомбардОтправитель</xr:Item>
						<xr:Item>Document.ЛБ_РасходОтходовДМ.Attribute.Ломбард</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СкладПолучатель</Name>
					<References>
						<xr:Item>Document.ЛБ_ПриходОтходовДМ.Attribute.Склад</xr:Item>
						<xr:Item>Document.ЛБ_РасходОтходовДМ.Attribute.СкладПолучатель</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЛомбардПолучатель</Name>
					<References>
						<xr:Item>Document.ЛБ_ПриходОтходовДМ.Attribute.Ломбард</xr:Item>
						<xr:Item>Document.ЛБ_РасходОтходовДМ.Attribute.Получатель</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

AccumulationRegisters/ЛБ_ДвижениеОтходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ДвижениеОтходов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛомбардПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Центральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОтходыДМВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОтходыДМВПути</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛомбардОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛомбардПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РасходОтходовДМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОтходыДМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОтходыДМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятьПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оприходовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переместить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Витрина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщийСкладЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлеймениеМаркировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспертиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаОбщая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМОбщий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Находки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мониторинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реактивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчебныйЦентр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_РасходОтходовДМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_РасходОтходовДМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ДвижениеОтходов</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОтходыДМВПути</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБезТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОтходыДМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

DocumentJournals/ЛБ_УчетОтходовДМ/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		Ломбард = ПараметрыСеанса.ТекущийЛомбард;
		ОтбиратьПо = 0;
		Элементы.ОтбиратьПо.ТолькоПросмотр = Истина;
	Иначе
		Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
	КонецЕсли;
	
	//+МАН 17.12.25
	ЗаполнитьСклады();
	//-МАН
	
	Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	
	ИзменитьОтбор();
	
	//Если РольДоступна("ЛБ_СотрудникЦО") Тогда
	Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
		Элементы.Ломбард.ТолькоПросмотр = Ложь;
		СотрудникЦО = Истина;
	Иначе
		Элементы.Ломбард.ТолькоПросмотр = Истина;
		СотрудникЦО = Ложь;
	КонецЕсли;	
	
	ОбновитьВес();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардПриИзменении(Элемент)
	ЗаполнитьСклады();
	ИзменитьОтбор();
	ТекущийЭлемент = Элементы.Список;
	ОбновитьВес();
	
	УстановитьДоступность();
КонецПроцедуры

&НаСервере
Процедура ИзменитьОтбор()

	Ломбарды = "";
	
	Если ЗначениеЗаполнено(Ломбард) Тогда
		Если ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
			Ломбарды = ПолучитьЛомбардыОтделения(Ломбард);
			
			Список.ТекстЗапроса = "ВЫБРАТЬ
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Ссылка КАК Ссылка,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Дата КАК Дата,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.ПометкаУдаления КАК ПометкаУдаления,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Номер КАК Номер,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Проведен КАК Проведен,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Приход КАК Приход,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Расход КАК Расход,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.НомерНакладной КАК НомерНакладной,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Комментарий КАК Комментарий,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Ответственный КАК Ответственный,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.НомерДокумента КАК НомерДокумента,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.СкладОтправитель КАК СкладОтправитель,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.ЛомбардОтправитель КАК ЛомбардОтправитель,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.СкладПолучатель КАК СкладПолучатель,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.ЛомбардПолучатель КАК ЛомбардПолучатель,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Тип КАК Тип
								|ИЗ
								|	ЖурналДокументов.ЛБ_УчетОтходовДМ КАК ЖурналДокументовЛБ_УчетОтходовДМ
								|ГДЕ
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Ссылка.Ломбард В(&Ломбард)";
			
			Список.Параметры.УстановитьЗначениеПараметра("Ломбард", Ломбарды);
			
			//ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "111 = 111", "ЖурналДокументовЛБ_УчетОтходовДМ.Ссылка.Ломбард В(&Ломбард)");
		ИначеЕсли ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
			Ломбарды = ?(ЗначениеЗаполнено(СкладЛомбарда), Ломбард, Справочники.ЛБ_Ломбарды.ПустаяСсылка());
			
			Список.ТекстЗапроса = "ВЫБРАТЬ
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Ссылка КАК Ссылка,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Дата КАК Дата,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.ПометкаУдаления КАК ПометкаУдаления,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Номер КАК Номер,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Проведен КАК Проведен,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Приход КАК Приход,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Расход КАК Расход,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.НомерНакладной КАК НомерНакладной,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Комментарий КАК Комментарий,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Ответственный КАК Ответственный,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.НомерДокумента КАК НомерДокумента,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.СкладОтправитель КАК СкладОтправитель,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.ЛомбардОтправитель КАК ЛомбардОтправитель,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.СкладПолучатель КАК СкладПолучатель,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.ЛомбардПолучатель КАК ЛомбардПолучатель,
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Тип КАК Тип
								|ИЗ
								|	ЖурналДокументов.ЛБ_УчетОтходовДМ КАК ЖурналДокументовЛБ_УчетОтходовДМ
								|ГДЕ
								|	ЖурналДокументовЛБ_УчетОтходовДМ.Ссылка.Ломбард В(&Ломбард)
								|	И ЖурналДокументовЛБ_УчетОтходовДМ.Ссылка.Склад В(&Склад)";
			
			Список.Параметры.УстановитьЗначениеПараметра("Ломбард", Ломбарды);
			Список.Параметры.УстановитьЗначениеПараметра("Склад", СкладЛомбарда);
			
			//ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "111 = 111", "ЖурналДокументовЛБ_УчетОтходовДМ.Ссылка.Ломбард В(&Ломбард)
			//															|	И ЖурналДокументовЛБ_УчетОтходовДМ.Ссылка.Склад В(&Склад)");
		КонецЕсли;
	ИначеЕсли НЕ ЗначениеЗаполнено(Ломбард) И НЕ ЗначениеЗаполнено(СкладЛомбарда) Тогда
		Список.ТекстЗапроса = "ВЫБРАТЬ
							|	ЖурналДокументовЛБ_УчетОтходовДМ.Ссылка КАК Ссылка,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.Дата КАК Дата,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.ПометкаУдаления КАК ПометкаУдаления,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.Номер КАК Номер,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.Проведен КАК Проведен,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.Приход КАК Приход,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.Расход КАК Расход,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.НомерНакладной КАК НомерНакладной,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.Комментарий КАК Комментарий,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.Ответственный КАК Ответственный,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.НомерДокумента КАК НомерДокумента,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.СкладОтправитель КАК СкладОтправитель,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.ЛомбардОтправитель КАК ЛомбардОтправитель,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.СкладПолучатель КАК СкладПолучатель,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.ЛомбардПолучатель КАК ЛомбардПолучатель,
							|	ЖурналДокументовЛБ_УчетОтходовДМ.Тип КАК Тип
							|ИЗ
							|	ЖурналДокументов.ЛБ_УчетОтходовДМ КАК ЖурналДокументовЛБ_УчетОтходовДМ";
		
		//ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "111 = 111", "Истина");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	//Если ТипЗнч(Элемент.ТекущаяСтрока) = Тип("ДокументСсылка.ЛБ_РасходОтходовДМ") Тогда
	//	Элементы.СписокКоманднаяПанель.ПодчиненныеЭлементы.СписокПечать.Доступность = Истина;
	//Иначе
	//	Элементы.СписокКоманднаяПанель.ПодчиненныеЭлементы.СписокПечать.Доступность = Ложь;
	//КонецЕсли;
	//ОбновитьВес();
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	Если ТипЗнч(ТекущийЭлемент.ТекущаяСтрока) = Тип("ДокументСсылка.ЛБ_РасходОтходовДМ") Тогда
		Проведен = СтатусДокумента(ТекущийЭлемент.ТекущаяСтрока);
		Если Проведен Тогда 
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ИменаМакетов", "РасходнаяНакладная"); 
			ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_РасходОтходовДМ");
			
			СтруктураВозврата = ПолучитьРеквизитыДокумента(ТекущийЭлемент.ТекущаяСтрока);
			
			ПараметрыПечати = Новый Структура;
			ПараметрыПечати.Вставить("ЗаголовокФормы", "Расход отходов ДМ " + СтруктураВозврата.НомерДокумента + " от " + СтруктураВозврата.Дата);
			
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ТекущийЭлемент.ТекущаяСтрока);
			
			ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
			ПараметрыФормы.Вставить("ПараметрыПечати", ПараметрыПечати);
			
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,);   
		Иначе
			Предупреждение("Перед печатью необходимо провести документ!");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыДокумента(Ссылка)
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("НомерДокумента", Ссылка.НомерДокумента);
	СтруктураВозврата.Вставить("Дата", Ссылка.Дата);
	
	Возврат СтруктураВозврата;
КонецФункции

&НаСервере
Функция СтатусДокумента(Ссылка)
	Возврат Ссылка.Проведен;
КонецФункции

&НаСервере
Процедура ОбновитьВес()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДвижениеОтходовОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвижениеОтходов.Остатки(
		|			&Дата,
		|			111 = 111
		|				И 222 = 222) КАК ЛБ_ДвижениеОтходовОстатки";
	
	Если ЗначениеЗаполнено(Ломбард) Тогда
		Если ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
			Ломбарды = ПолучитьЛомбардыОтделения(Ломбард);
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "Ломбард В(&Ломбард)");
			
			Запрос.УстановитьПараметр("Ломбард", Ломбарды);
		ИначеЕсли ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
			Ломбарды = ?(ЗначениеЗаполнено(СкладЛомбарда), Ломбард, Справочники.ЛБ_Ломбарды.ПустаяСсылка());
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "Ломбард В(&Ломбард)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "222 = 222", "Склад В(&Склад)");
			
			Запрос.УстановитьПараметр("Ломбард", Ломбарды);
			Запрос.УстановитьПараметр("Склад", СкладЛомбарда);
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Вес = Формат(Результат.ВесНеттоОстаток, "ЧДЦ=2; ЧН=0,00");
	Иначе
		Вес = 0.00;
	КонецЕсли;

	Элементы.ДекорацияВес.Заголовок = "Текущее наличие нетто: " + Вес + " гр.";
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриход(Команда)
	
	//+МАН 17.12.25
	Если НЕ ЗначениеЗаполнено(СкладЛомбарда) Тогда
		Предупреждение("Не выбран склад!
		|Создание документа невозможно!");
		Возврат;
	КонецЕсли;
	//-МАН
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ломбард", Ломбард);
	//+МАН 17.12.25
	ПараметрыФормы.Вставить("Склад", СкладЛомбарда);
	//-МАН
	
	//+МАН 15.12.25
	ОписаниеОповещенияПослеДобавлениДокумента = Новый ОписаниеОповещения("ПослеДобавлениДокумента", ЭтотОбъект);
	//-МАН
	
	ОткрытьФорму("Документ.ЛБ_ПриходОтходовДМ.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещенияПослеДобавлениДокумента, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРасход(Команда)
	
	//+МАН 17.12.25
	Если НЕ ЗначениеЗаполнено(СкладЛомбарда) Тогда
		Предупреждение("Не выбран склад!
		|Создание документа невозможно!");
		Возврат;
	КонецЕсли;
	//-МАН

	ОбновитьВес();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ломбард", Ломбард);
	ПараметрыФормы.Вставить("Вес", Вес);
	//+МАН 17.12.25 Исменил
	ПараметрыФормы.Вставить("Склад", СкладЛомбарда);
	//-МАН
	
	//+МАН 15.12.25
	ОписаниеОповещенияПослеДобавлениДокумента = Новый ОписаниеОповещения("ПослеДобавлениДокумента", ЭтотОбъект);
	//-МАН
	
	ОткрытьФорму("Документ.ЛБ_РасходОтходовДМ.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещенияПослеДобавлениДокумента, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеДобавлениДокумента(Результат, ДополнительныеПараметры) Экспорт
	ПодключитьОбработчикОжидания("ВыполнитьОбновлениеВеса", 0.5, Истина);
	ОбновитьВес();
КонецПроцедуры

&НаКлиенте
Процедура Пауза(Секунды)
	ВремяОкончания = ТекущаяДата() + Секунды;
	Пока ТекущаяДата() <= ВремяОкончания Цикл
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Пауза(0.05);
	ОбновитьВес();
	ПодключитьОбработчикОжидания("ВыполнитьОбновлениеВеса", 0.5, Истина);
	ОбновитьВес();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПроведение(Команда)
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		СтруктураВозврата = ОтменитьПроведениеНаСервере(ТекСтрока);
		
		Если СтруктураВозврата.Результат Тогда
			ОповеститьОбИзменении(ТекСтрока);
			ОбновитьВес();
		Иначе
			Предупреждение(СтруктураВозврата.Сообщение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтменитьПроведениеНаСервере(Док, Удаление = Ложь)

	СтруктураВозврата = Новый Структура;
	
	Если НЕ Удаление Тогда

		Если Док.ПометкаУдаления Тогда
			СтруктураВозврата.Вставить("Результат", Ложь);
			СтруктураВозврата.Вставить("Сообщение", "Выбранная операция помечена на удаление!");
			Возврат СтруктураВозврата;
		КонецЕсли;
		
		Если СотрудникЦО Тогда
			Секунд = 86400; //Сутки
			Текст = "Отменить проведение операции возможно только в течение суток с момента создания!";
		Иначе
			Секунд = 3600; //Час
			Текст = "Отменить проведение операции возможно только в течение часа с момента создания!";
		КонецЕсли;
		
		Если Док.Проведен И (День(ТекущаяДата()) - День(Док.Дата)) <> 0 Тогда
			СтруктураВозврата.Вставить("Результат", Ложь);
			СтруктураВозврата.Вставить("Сообщение", "Нельзя снять с проведения операцию, созданную ранее текущего дня!");
			Возврат СтруктураВозврата;
		КонецЕсли;
		
		Если Док.Проведен И (ТекущаяДата() - Док.Дата) > Секунд Тогда
			СтруктураВозврата.Вставить("Результат", Ложь);
			СтруктураВозврата.Вставить("Сообщение", Текст);
			Возврат СтруктураВозврата;
		КонецЕсли;
		
		ЕстьДокументы = ПроверитьДокументы(Док);
		
		Если ЕстьДокументы Тогда
			СтруктураВозврата.Вставить("Результат", Ложь);
			
			Если ТипЗнч(Док) = Тип("ДокументСсылка.ЛБ_РасходОтходовДМ") Тогда
				СтруктураВозврата.Вставить("Сообщение", "Невозможно отменить проведение накладной, так как перемещение принято в ломбарде получателе.");
			Иначе
				СтруктураВозврата.Вставить("Сообщение", "Отменить проведение операции невозможно, так как есть последующие операции.");
			КонецЕсли;
			
			Возврат СтруктураВозврата;
		КонецЕсли;

		//Если ТипЗнч(Док) = Тип("ДокументСсылка.ЛБ_РасходОтходовДМ") Тогда
		//	ПеремещениеПринято = ПроверитьПринятиеПеремещения(Док);
		//	
		//	Если ПеремещениеПринято Тогда
		//		СтруктураВозврата.Вставить("Результат", Ложь);
		//		СтруктураВозврата.Вставить("Сообщение", "Невозможно отменить проведение накладной, так как перемещение принято в ломбарде получателе.");
		//		Возврат СтруктураВозврата;
		//	КонецЕсли;
		//КонецЕсли;
		
		ДокОбъект = Док.ПолучитьОбъект();
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			СтруктураВозврата.Вставить("Результат", Истина);
			Возврат СтруктураВозврата;
		Исключение
			СтруктураВозврата.Вставить("Результат", Ложь);
			СтруктураВозврата.Вставить("Сообщение", "Ошибка отмены проведения документа!");
			Возврат СтруктураВозврата;
		КонецПопытки
	Иначе
		СтруктураВозврата.Вставить("Результат", Истина);
		Возврат СтруктураВозврата;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Провести(Команда)
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		СтруктураВозврата = ПровестиНаСервере(ТекСтрока);
		
		Если СтруктураВозврата.Результат Тогда
			ОповеститьОбИзменении(ТекСтрока);
			ОбновитьВес();
		Иначе
			Предупреждение(СтруктураВозврата.Сообщение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПровестиНаСервере(Док)
	ДокОбъект = Док.ПолучитьОбъект();

	Дата = ТекущаяДата();
	
	СтруктураВозврата = Новый Структура;

	Если ДокОбъект.ПометкаУдаления Тогда
		СтруктураВозврата.Вставить("Результат", Ложь);
		СтруктураВозврата.Вставить("Сообщение", "Выбранный документ помечен на удаление!");
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ЛБ_РасходОтходовДМ") Тогда
		ЕстьВесДляРасхода = ПроверитьДоступныйВес(Док, Дата);
		
		Если НЕ ЕстьВесДляРасхода Тогда
			СтруктураВозврата.Вставить("Результат", Ложь);
			СтруктураВозврата.Вставить("Сообщение", "Недостаточно веса чтобы провести документ!");
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ЛБ_ПриходОтходовДМ") И Док.ВидОперации = Перечисления.ЛБ_ВидыОперацийОтходыДМ.ПринятьПеремещение Тогда
		Если НЕ Док.ДокументПеремещения.Проведен Тогда
			СтруктураВозврата.Вставить("Результат", Ложь);
			СтруктураВозврата.Вставить("Сообщение", "Документ перемещения не проведен.");
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЕсли;
	
	ДокОбъект.Дата = Дата;
	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		СтруктураВозврата.Вставить("Результат", Истина);
		Возврат СтруктураВозврата;
	Исключение
		СтруктураВозврата.Вставить("Результат", Ложь);
		СтруктураВозврата.Вставить("Сообщение", "Ошибка проведения, документ не проведен!");
		Возврат СтруктураВозврата;
	КонецПопытки
	
КонецФункции

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		СтруктураВозврата = ПометитьНаУдалениеНаСервере(ТекСтрока);
		
		Если СтруктураВозврата.Результат Тогда
			ОповеститьОбИзменении(ТекСтрока);
			ОбновитьВес();
		Иначе
			Предупреждение(СтруктураВозврата.Сообщение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПометитьНаУдалениеНаСервере(Док)

	СтруктураВозврата = Новый Структура;
	
	Если Док.ПометкаУдаления Тогда
		СтруктураВозврата.Вставить("Результат", Ложь);
		СтруктураВозврата.Вставить("Сообщение", "Операция уже помечена на удаление!");
		Возврат СтруктураВозврата;
	КонецЕсли;

	Если СотрудникЦО Тогда
		Секунд = 86400; //Сутки
		Текст = "Удаление операции возможно только в течение суток с момента создания!";
	Иначе
		Секунд = 3600; //Час
		Текст = "Удаление операции возможно только в течение часа с момента создания!";
	КонецЕсли;
	
	Если Док.Проведен И (День(ТекущаяДата()) - День(Док.Дата)) <> 0 Тогда
		СтруктураВозврата.Вставить("Результат", Ложь);
		СтруктураВозврата.Вставить("Сообщение", "Нельзя удалить операцию, созданную ранее текущего дня!");
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если Док.Проведен И (ТекущаяДата() - Док.Дата) > Секунд Тогда
		СтруктураВозврата.Вставить("Результат", Ложь);
		СтруктураВозврата.Вставить("Сообщение", Текст);
		Возврат СтруктураВозврата;
	КонецЕсли;

	ЕстьДокументы = ПроверитьДокументы(Док);
	
	Если ЕстьДокументы Тогда
		СтруктураВозврата.Вставить("Результат", Ложь);
		СтруктураВозврата.Вставить("Сообщение", "Удалить операцию невозможно, так как есть последующие операции.");
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозвратаОтмены = ОтменитьПроведениеНаСервере(Док, Истина);
	
	Если НЕ СтруктураВозвратаОтмены.Результат Тогда
		Возврат СтруктураВозвратаОтмены;
	Иначе
		ДокОбъект = Док.ПолучитьОбъект();
		
		Пометка = ?(ДокОбъект.ПометкаУдаления, Ложь, Истина);
		
		ДокОбъект.УстановитьПометкуУдаления(Пометка);
		СтруктураВозврата.Вставить("Результат", Истина);
		
		Возврат СтруктураВозврата;
	КонецЕсли;
		
КонецФункции

&НаСервере
Функция ПроверитьДокументы(Док)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛБ_ДвижениеОтходовОбороты.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвижениеОтходов.Обороты(
		|			&ДатаНач,
		|			&ДатаКон,
		|			Регистратор,
		|			111 = 111
		|				И 222 = 222) КАК ЛБ_ДвижениеОтходовОбороты
		|ГДЕ
		|	ЛБ_ДвижениеОтходовОбороты.Регистратор ССЫЛКА 333 = 333";
	//-МАН
	
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ЛБ_ПриходОтходовДМ") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "Ломбард = &Ломбард");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "222 = 222", "Склад = &Склад");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "333 = 333", "Документ.ЛБ_РасходОтходовДМ");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "ЛомбардПолучатель = &Ломбард");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "222 = 222", "СкладПолучатель = &Склад");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "333 = 333", "Документ.ЛБ_ПриходОтходовДМ");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата());
	Запрос.УстановитьПараметр("ДатаНач", Док.Дата + 1);
	Запрос.УстановитьПараметр("Ломбард", Док.Ломбард);
	//+МАН 17.12.25
	Запрос.УстановитьПараметр("Склад", Док.Склад);
	//-МАН
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступность()
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекСтрока <> Неопределено Тогда
		Если ТипЗнч(ТекСтрока) = Тип("ДокументСсылка.ЛБ_РасходОтходовДМ") Тогда
			Элементы.СписокКоманднаяПанель.ПодчиненныеЭлементы.СписокПечать.Доступность = Истина;
		Иначе
			Элементы.СписокКоманднаяПанель.ПодчиненныеЭлементы.СписокПечать.Доступность = Ложь;
		КонецЕсли;
		
		Если ТекСтрока.Проведен Тогда
			Элементы.СписокКоманднаяПанель.ПодчиненныеЭлементы.СписокОтменитьПроведение.Доступность = Истина;
			Элементы.СписокКоманднаяПанель.ПодчиненныеЭлементы.СписокПровести.Доступность = Ложь;
		Иначе
			Элементы.СписокКоманднаяПанель.ПодчиненныеЭлементы.СписокОтменитьПроведение.Доступность = Ложь;
			Элементы.СписокКоманднаяПанель.ПодчиненныеЭлементы.СписокПровести.Доступность = Истина;
		КонецЕсли;
		
		Элементы.СписокКоманднаяПанель.ПодчиненныеЭлементы.СписокПометитьНаУдаление.Доступность = Истина;
	Иначе
		Элементы.СписокКоманднаяПанель.ПодчиненныеЭлементы.СписокПечать.Доступность = Ложь;
		Элементы.СписокКоманднаяПанель.ПодчиненныеЭлементы.СписокОтменитьПроведение.Доступность = Ложь;
		Элементы.СписокКоманднаяПанель.ПодчиненныеЭлементы.СписокПометитьНаУдаление.Доступность = Ложь;
		Элементы.СписокКоманднаяПанель.ПодчиненныеЭлементы.СписокПровести.Доступность = Ложь;
	КонецЕсли;
	
	//+МАН 29.12.25
	Если ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
		Элементы.СкладЛомбарда.ТолькоПросмотр = Истина;
	Иначе
		Если Элементы.СкладЛомбарда.СписокВыбора.Количество() > 1 Тогда
			Элементы.СкладЛомбарда.ТолькоПросмотр = Ложь;
		Иначе
			Элементы.СкладЛомбарда.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	//-МАН
	
КонецПроцедуры

//+МАН 17.12.25
&НаСервере
Процедура ЗаполнитьСклады()
	Если ЗначениеЗаполнено(Ломбард) Тогда
		Склады = ЗаполнитьСписокВыбораСкладов(Ломбард);
		
		Если Склады.Количество() > 1 Тогда
			Элементы.СкладЛомбарда.СписокВыбора.Очистить();
			Элементы.СкладЛомбарда.СписокВыбора.ЗагрузитьЗначения(Склады);
			СкладЛомбарда = Справочники.ЛБ_Склады.ПустаяСсылка();
		ИначеЕсли Склады.Количество() = 1 Тогда
			Элементы.СкладЛомбарда.СписокВыбора.Очистить();
			Элементы.СкладЛомбарда.СписокВыбора.Добавить(Склады[0]);
			СкладЛомбарда = Склады[0];
		Иначе
			Элементы.СкладЛомбарда.СписокВыбора.Очистить();
			СкладЛомбарда = Справочники.ЛБ_Склады.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокВыбораСкладов(Ломбард)

	МассивСкладов = Новый Массив;
	
	Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_Склады.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ЛБ_Склады КАК ЛБ_Склады
		               |ГДЕ
		               |	ЛБ_Склады.Владелец = &Владелец
		               |	И (ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМ)
		               |			ИЛИ ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМЦО)
		               |			ИЛИ ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМОбщий))";
		Запрос.УстановитьПараметр("Владелец", Ломбард);

		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МассивСкладов.Добавить(Выборка.Ссылка);
		Конеццикла;
	КонецЕсли;
	
	Возврат МассивСкладов;
КонецФункции

&НаКлиенте
Процедура СкладЛомбардаПриИзменении(Элемент)
	ИзменитьОтбор();
	ТекущийЭлемент = Элементы.Список;
	ОбновитьВес();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбновлениеВеса()
	ОбновитьВес();
КонецПроцедуры

//+МАН 29.12.25
&НаКлиенте
Процедура ОтбиратьПоПриИзменении(Элемент)
	СкладЛомбарда = ПредопределенноеЗначение("Справочник.ЛБ_Склады.ПустаяСсылка");
	УстановитьОтбиратьПо();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбиратьПо()
	
	Если ОтбиратьПо = 0 Тогда
		ТипСтр = "СправочникСсылка.ЛБ_Ломбарды";
	    Элементы.Ломбард.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
		//Элементы.СкладЛомбарда.ТолькоПросмотр = Ложь;
		Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
			Ломбард = Справочники.ЛБ_Ломбарды.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ОтбиратьПо = 1 Тогда
		ТипСтр = "СправочникСсылка.ЛБ_ОтделенияЛомбардов";
	    Элементы.Ломбард.ОграничениеТипа = Новый ОписаниеТипов(ТипСтр);
		//Элементы.СкладЛомбарда.ТолькоПросмотр = Истина;
		Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
			Ломбард = Справочники.ЛБ_ОтделенияЛомбардов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Значение = Элементы.Ломбард;
    Элементы.Ломбард.ОграничениеТипа.ПривестиЗначение(Значение);
    Элементы.Ломбард.ВыбиратьТип = Ложь;
	Элементы.СкладЛомбарда.СписокВыбора.Очистить();
	ИзменитьОтбор();
	ОбновитьВес();
	УстановитьДоступность();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЛомбардыОтделения(Отделение)
	
	МассивВозвората = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение = &Отделение) КАК ЛБ_ОтделенияЛомбардовСрезПоследних";
		//|ГДЕ
		//|	НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт
		//|	И НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Отделение", Отделение);
	
    РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		МассивВозвората.Добавить(РезультатЗапроса.Ломбард);
	КонецЦикла;
	
	Если МассивВозвората.Количество() > 0 Тогда
		Возврат МассивВозвората;
	Иначе
		Возврат Справочники.ЛБ_Ломбарды.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЛомбардОчистка(Элемент, СтандартнаяОбработка)
	СкладЛомбарда = ПредопределенноеЗначение("Справочник.ЛБ_Склады.ПустаяСсылка");
	Элементы.СкладЛомбарда.СписокВыбора.Очистить();
	ИзменитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Список.Обновить();
	ОбновитьВес();
КонецПроцедуры

&НаКлиенте
Процедура ВПути(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Форма", "Журнал");
	
	Если ЗначениеЗаполнено(Ломбард) Тогда
		Если ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
			Ломбарды = ПолучитьЛомбардыОтделения(Ломбард);

			ПараметрыФормы.Вставить("Ломбард", Ломбарды);
			
		ИначеЕсли ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
			Ломбарды = ?(ЗначениеЗаполнено(СкладЛомбарда), Ломбард, ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ПустаяСсылка"));
			
			ПараметрыФормы.Вставить("Ломбард", Ломбарды);
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЛБ_ПриходОтходовДМ.Форма.ФормаВПути", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДоступныйВес(Ссылка, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДвижениеОтходовОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвижениеОтходов.Остатки(
		|			&Дата,
		|			Ломбард = &Ломбард
		|				И Склад = &Склад) КАК ЛБ_ДвижениеОтходовОстатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ссылка.Ломбард);
	Запрос.УстановитьПараметр("Склад", Ссылка.Склад);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.ВесНеттоОстаток >= Ссылка.ВесБезТары;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	ОповеститьОбИзменении(НовыйОбъект);
	ОбновитьВес();
КонецПроцедуры

&НаСервере
Функция ПроверитьПринятиеПеремещения(Док)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтходыДМВПутиОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток
		|ИЗ
		|	РегистрНакопления.ЛБ_ОтходыДМВПути.Остатки(, ДокументПеремещения = &ДокументПеремещения) КАК ЛБ_ОтходыДМВПутиОстатки";
	
	Запрос.УстановитьПараметр("ДокументПеремещения", Док);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.ВесНеттоОстаток = 0;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
//-МАН
